In [1]:
import pandas as pd
import numpy as np

In [2]:
the_akas = '/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/title-akas-us-only.csv'
akas_df = pd.read_csv(the_akas, low_memory=False)

In [3]:
the_basics = '/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/title.basics.tsv.gz'
basics_df = pd.read_csv(the_basics, sep='\t', low_memory=False)

In [4]:
the_ratings = '/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/title.ratings.tsv.gz'
ratings_df = pd.read_csv(the_ratings, sep='\t', low_memory=False)

In [5]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [6]:
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [7]:
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       265
2  tt0000003            6.5      1850
3  tt0000004            5.5       178
4  tt0000005            6.2      2634

# Movie Title AKA - Filtering\Cleaning

## Replace "\N" with np.nan

In [8]:
#Replacing '\N' values in dataframe with 'np.nan'
akas_df = akas_df.replace('\\N',np.nan)

In [9]:
#Confirming changes.
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [10]:
#checking for duplicates
akas_df.duplicated().sum()

0

In [11]:
#checking to make sure 'region' column is US for all rows.
akas_df['region'].value_counts()

US    1452564
Name: region, dtype: int64

# Movie Title Basics - Filtering\Cleaning

## Include only movies that were released in the United States.

In [12]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers =basics_df['tconst'].isin(akas_df['titleId'])
keepers

0            True
1            True
2           False
3           False
4            True
            ...
10036507    False
10036508    False
10036509    False
10036510    False
10036511    False
Name: tconst, Length: 10036512, dtype: bool

In [13]:
#Filtering and replacing the dataframe.
basics_df = basics_df[keepers]
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"
...,...,...,...,...,...,...,...,...,...
10036373,tt9916560,tvMovie,March of Dimes Presents: Once Upon a Dime,March of Dimes Presents: Once Upon a Dime,0,1963,\N,58,Family
10036402,tt9916620,movie,The Copeland Case,The Copeland Case,0,\N,\N,\N,Drama
10036440,tt9916702,short,Loving London: The Playground,Loving London: The Playground,0,\N,\N,\N,"Drama,Short"
10036463,tt9916756,short,Pretty Pretty Black Girl,Pretty Pretty Black Girl,0,2019,\N,\N,Short
10036467,tt9916764,short,38,38,0,2018,\N,\N,Short

In [14]:
#Replacing '\N' values in dataframe with 'np.nan'
basics_df = basics_df.replace({'\\N':np.nan})

In [15]:
#confirming changes
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,NaN,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,NaN,1,"Short,Sport"

## Include only movies that were released 2000 - 2021 (include 2000 and 2021)

In [16]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1365742 entries, 0 to 10036467
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          1365742 non-null  object
 1   titleType       1365742 non-null  object
 2   primaryTitle    1365742 non-null  object
 3   originalTitle   1365742 non-null  object
 4   isAdult         1365742 non-null  object
 5   startYear       1267216 non-null  object
 6   endYear         37175 non-null    object
 7   runtimeMinutes  862776 non-null   object
 8   genres          1337266 non-null  object
dtypes: object(9)
memory usage: 104.2+ MB

In [17]:
#changeing datatype of column 'startYear'
basics_df["startYear"] = basics_df["startYear"].astype("float64")

In [18]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1365742 entries, 0 to 10036467
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          1365742 non-null  object
 1   titleType       1365742 non-null  object
 2   primaryTitle    1365742 non-null  object
 3   originalTitle   1365742 non-null  object
 4   isAdult         1365742 non-null  object
 5   startYear       1267216 non-null  float64
 6   endYear         37175 non-null    object
 7   runtimeMinutes  862776 non-null   object
 8   genres          1337266 non-null  object
dtypes: float64(1), object(8)
memory usage: 104.2+ MB

In [19]:
#filtering between years 2000-2021
basics_df = basics_df[(basics_df['startYear'] >= 2000) & (basics_df['startYear'] <= 2021)]

In [20]:
#checking filter changes to dataframe.
basics_df['startYear'].value_counts()

2018.0    64057
2017.0    62791
2019.0    60336
2016.0    60299
2015.0    57051
2020.0    56737
2014.0    55743
2021.0    53807
2013.0    51509
2012.0    47812
2011.0    44307
2010.0    38626
2009.0    35269
2008.0    30381
2007.0    27759
2006.0    26291
2005.0    23449
2004.0    20374
2003.0    17282
2002.0    15106
2001.0    13695
2000.0    12769
Name: startYear, dtype: int64

## Include only full-length movies (titleType = "movie").

In [21]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
33802,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001.0,NaN,20,Short
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
39544,tt0040241,short,Color Rhapsodie,Color Rhapsodie,0,2021.0,NaN,6,Short
43546,tt0044326,short,Abstronic,Abstronic,0,2021.0,NaN,6,Short
49493,tt0050396,short,Final Curtain,Final Curtain,0,2012.0,NaN,20,"Horror,Short"

In [22]:
basics_df.shape

(875450, 9)

In [23]:
basics_df["titleType"] = basics_df["titleType"].astype("str",copy=False)

In [24]:
basics_df = basics_df[basics_df["titleType"] == "movie"]

In [25]:
basics_df.shape

(135095, 9)

In [26]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67488,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

## Eliminate movies that are null for runtimeMinutes

In [27]:
#checking current shape of dataframe basics_df
basics_df.shape

(135095, 9)

In [28]:
#checking count of np.nan (null) values.
basics_df['runtimeMinutes'].isna().sum()

19164

In [29]:
#removing rows where 'runtimeMinutes' equals null\np.nan 
basics_df = basics_df.dropna(subset=['runtimeMinutes'])

In [30]:
#confirming change in size of basics dataframe
basics_df.shape

(115931, 9)

## Eliminate movies that are null for genre

In [31]:
#checking current shape of dataframe basics_df
basics_df.shape

(115931, 9)

In [32]:
#checking count of np.nan (null) values.
basics_df['genres'].isna().sum()

1487

In [33]:
#removing rows where 'genres' equals null\np.nan 
basics_df = basics_df.dropna(subset=['genres'])

In [34]:
#confirming change in size of basics dataframe
basics_df.shape

(114444, 9)

## Eliminate movies that include "Documentary" in the genre (see tip below).

In [35]:
#quick view of contents of column 'genres'
basics_df['genres'].value_counts()

Documentary                    20107
Drama                          16146
Comedy                          6736
Comedy,Drama                    3812
Horror                          3743
                               ...
History,Sci-Fi                     1
Biography,War                      1
Comedy,Mystery,Sport               1
Action,Documentary,News            1
Mystery,Reality-TV,Thriller        1
Name: genres, Length: 1040, dtype: int64

---

* You will also want to use the `~` operator to take the inverse of your Trues/Falses.

In [36]:
# Exclude movies that are included in the documentary category.
is_documentary = basics_df['genres'].str.contains('documentary',case=False)
basics_df = basics_df[~is_documentary]

In [37]:
basics_df['genres'].value_counts()

Drama                          16146
Comedy                          6736
Comedy,Drama                    3812
Horror                          3743
Drama,Romance                   2517
                               ...
Action,Crime,Music                 1
Fantasy,Sci-Fi,Western             1
Biography,History,Thriller         1
Action,Animation,Game-Show         1
Mystery,Reality-TV,Thriller        1
Name: genres, Length: 843, dtype: int64

# Movie Title Rating - Filtering\Cleaning

## Keep only movies that were included in your final title basics dataframe above.
* (Use AKAs table, see "Filtering one dataframe based on another" section below)

In [38]:
display( akas_df.head() )
display( akas_df.shape )

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

(1452564, 8)

In [39]:
display( ratings_df.head() )
display( ratings_df.shape )

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       265
2  tt0000003            6.5      1850
3  tt0000004            5.5       178
4  tt0000005            6.2      2634

(1333263, 3)

In [40]:
#Filtering tables ratings and akas.
new_filter = ratings_df['tconst'].isin( akas_df['titleId'] )

In [41]:
new_filter

0           True
1           True
2          False
3          False
4           True
           ...
1333258    False
1333259    False
1333260    False
1333261    False
1333262    False
Name: tconst, Length: 1333263, dtype: bool

In [42]:
ratings_df = ratings_df[new_filter]

In [43]:
ratings_df

            tconst  averageRating  numVotes
0        tt0000001            5.7      1989
1        tt0000002            5.8       265
4        tt0000005            6.2      2634
5        tt0000006            5.1       182
6        tt0000007            5.4       825
...            ...            ...       ...
1333224  tt9916200            8.1       231
1333225  tt9916204            8.2       265
1333232  tt9916348            8.3        18
1333233  tt9916362            6.4      5437
1333238  tt9916428            3.8        14

[504293 rows x 3 columns]

# Final Summary of RATINGS dataframe.

In [44]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 504293 entries, 0 to 1333238
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         504293 non-null  object
 1   averageRating  504293 non-null  float64
 2   numVotes       504293 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.4+ MB

# Final Summary of BASICS dataframe.

In [45]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81903 entries, 34802 to 10036278
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81903 non-null  object
 1   titleType       81903 non-null  object
 2   primaryTitle    81903 non-null  object
 3   originalTitle   81903 non-null  object
 4   isAdult         81903 non-null  object
 5   startYear       81903 non-null  float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  81903 non-null  object
 8   genres          81903 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.2+ MB

# Final Summary of AKAS dataframe.

In [46]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         4018 non-null     object
 5   types            981678 non-null   object
 6   attributes       47016 non-null    object
 7   isOriginalTitle  1451222 non-null  object
dtypes: int64(1), object(7)
memory usage: 88.7+ MB

# Saving dataframes as new .CSV files to repo.

In [47]:
#Saving RATINGS dataframe to .csv
ratings_df.to_csv('/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/Final_RATINGS.csv.gz', compression='gzip', index=False)

In [48]:
#Saving BASICS dataframe to .csv
basics_df.to_csv('/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/Final_BASICS.csv.gz', compression='gzip', index=False)

In [49]:
#Saving AKAS dataframe to .csv
akas_df.to_csv('/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/Final_AKAS.csv.gz', compression='gzip', index=False)